load-tests/load-config-sustained.yml
---
# Sustained Load Test: 50 Concurrent Users over 10 Minutes
# Tests for memory leaks, degradation, and long-term stability

config:
  target: http://localhost:3000
  phases:
    - duration: 600  # 10 minutes in seconds
      arrivalRate: 10
      rampTo: 50
      name: "Sustained Load (50 users, 10 min)"

  processor: "./scenario-processor.js"

  defaults:
    headers:
      Content-Type: application/json
      User-Agent: Artillery/LoadTest

  log:
    level: info

  # Track system resources during sustained test
  variables:
    start_time: "{{ $now }}"

scenarios:
  - name: "Assessment Submission Flow (Sustained)"
    flow:
      - post:
          url: "/api/v1/assessments"
          headers:
            X-Org-ID: "test-org-sustained"
          json:
            system_id: "{{ $randomChoice(['gpt-4', 'claude-3', 'llama-2']) }}"
            system_name: "System Sustained"
            system_info:
              endpoint: "https://api.example.com/v1"
              model: "{{ $randomChoice(['model-a', 'model-b', 'model-c']) }}"
              api_key: "sk-test-key-sustained-{{ $randomNumber(1, 1000) }}"
            tier: "{{ $randomChoice(['T1_STANDARD', 'T2_IDENTITY_CHALLENGE']) }}"
          expect:
            - statusCode: [201, 429, 503]
          capture:
            json: "$.assessment_id"
            as: "assessment_id"

      - think: 1

      - loop:
          - get:
              url: "/api/v1/assessments/{{ assessment_id }}"
              headers:
                X-Org-ID: "test-org-sustained"
              expect:
                - statusCode: [200, 404, 503]
              capture:
                json: "$.status"
                as: "job_status"
          - think: 2
        count: 20  # Poll more often during sustained test
        whileTrue: "{{ job_status != 'completed' && job_status != 'failed' }}"

      - get:
          url: "/api/v1/assessments/{{ assessment_id }}/result"
          headers:
            X-Org-ID: "test-org-sustained"
          expect:
            - statusCode: [200, 404, 503]